print(0o1, 0o20, 0o377)                                                 #вісімкові літерали(цифри від 0 до 7)
print(0x01, 0x10, 0xFF)                                                 #шістнацяткові літерали(цифри від 0-9,A-F)
print(0b1, 0b10000, 0b11111111)                                         #двійкові літерали(цифри від 0 до 1)

print(0xFF, (15 * (16 ** 1)) + (15 * (16 ** 0)))                        #шістнацяткове/двійкове число відображається як десяткове
print(0x2F, (2 * (16 ** 1)) + (15 * (16 ** 0)))
print(0xF, 0b1111, (1 * (2 ** 3) + 1 * (2 ** 2) + 1 * (2 ** 1) + 1 * (2 ** 0)))

print(oct(64), hex(64), bin(64))                                        #числа => строки цифр

print(64, 0o100, 0x40, 0b1000000)                                       #цифри => числа в сценаріях і строки
print(int('64'), int('100', 8), int('40', 16), int('1000000', 2))
print(int('0x40', 16), int('1000000', 2))                               #літеральні форми також підтримуються