X = 1                       #десяткове значення 1 в бітах виглядає як 0001
print(X << 2)               #зрушення вліво на 2 біта: 0100
print(X | 2)                #побітове АБО (один з бітів = 1): 0011
print(X & 1)                #побітове І (два біта = 1): 0001

X = 0b0001                  #двійковий літерал
print(X << 2)               #зрушення вліво
print(bin(X << 2))          #строка з двійкових цифр
print(bin(X | 0b010))       #побітове АБО: один з бітів = 1
print(bin(X & 0b1))         #побітове І: два біта = 1

X = 0xFF                    #шістнацятковий літерал
print(bin(X))
print(X ^ 0b10101010)       #побітове виняткове АБО: один з бітів = 1, но не два
print(bin(X^0b10101010))
print(int('01010101', 2))   #цифри => число: строка в ціле по вказаній основі
print(hex(85))              #число => цифри: строка шістнацяткових цифр

X = 99
print(bin(X), X.bit_length(), len(bin(X)) - 2)
print(bin(256), (256).bit_length(), len(bin(256)) - 2)